content.org
#+TITLE: CS 421 Web Content
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures

** Hoare Semantics
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type book
:EXPORT_FILE_NAME: hoare-semantics
:END:

The other semantics we have looked at enable us to understand how a program determines its value or type.  This kind of
semantics helps us understand the conditions under which a program will give us the correct answer.

*** Videos

      - [[/videos/hoare-semantics][Hoare Semantics]]
      - [[https://mediaspace.illinois.edu/media/t/1_2lxijk7p][Class Session (Spring 2022)]]
#        url: https://mediaspace.illinois.edu/media/t/1_mmsrj63i  Spring 2021
*** Further Reading
- [[https://www.cs.utexas.edu/users/EWD/transcriptions/EWD02xx/EWD264.html][EWD 264 /On Understanding Programs/]]

