content/lectures/hoare-semantics.md
+++
title = "Hoare Semantics"
author = ["Mattox Beckman"]
draft = false
type = "book"
+++

The other semantics we have looked at enable us to understand how a program determines its value or type.  This kind of
semantics helps us understand the conditions under which a program will give us the correct answer.


## Videos {#videos}

-   [Hoare Semantics](/videos/hoare-semantics)
-   [Class Session (Spring 2022)](https://mediaspace.illinois.edu/media/t/1_2lxijk7p)


## Further Reading {#further-reading}

-   [EWD 264 _On Understanding Programs_](https://www.cs.utexas.edu/users/EWD/transcriptions/EWD02xx/EWD264.html)
